RT-Thread-packages/nxp-mcx-series/MCXC162/drivers/fsl_ctimer.h
/* Get all the capture interrupts enabled */
#if !(defined(FSL_FEATURE_CTIMER_HAS_NO_INPUT_CAPTURE) && (FSL_FEATURE_CTIMER_HAS_NO_INPUT_CAPTURE))
    enabledIntrs |= base->CCR & (CTIMER_CCR_CAP0I_MASK | CTIMER_CCR_CAP1I_MASK
#if !(defined(FSL_FEATURE_CTIMER_HAS_NO_CCR_CAP2) && FSL_FEATURE_CTIMER_HAS_NO_CCR_CAP2)
                                 | CTIMER_CCR_CAP2I_MASK
#endif /* FSL_FEATURE_CTIMER_HAS_NO_CCR_CAP2 */
#if defined(FSL_FEATURE_CTIMER_HAS_CCR_CAP3) && FSL_FEATURE_CTIMER_HAS_CCR_CAP3
                                 | CTIMER_CCR_CAP3I_MASK
#endif /* FSL_FEATURE_CTIMER_HAS_CCR_CAP3 */
                                );
#endif

    return enabledIntrs;
}

/*! @}*/

/*!
 * @name Status Interface
 * @{
 */

/*!
 * @brief Gets the Timer status flags.
 *
 * @param base Ctimer peripheral base address
 *
 * @return The status flags. This is the logical OR of members of the
 *         enumeration ::ctimer_status_flags_t
 */
static inline uint32_t CTIMER_GetStatusFlags(CTIMER_Type *base)
{
    return base->IR;
}

/*!
 * @brief Clears the Timer status flags.
 *
 * @param base Ctimer peripheral base address
 * @param mask The status flags to clear. This is a logical OR of members of the
 *             enumeration ::ctimer_status_flags_t
 */
static inline void CTIMER_ClearStatusFlags(CTIMER_Type *base, uint32_t mask)
{
    base->IR = mask;
}

/*! @}*/

/*!
 * @name Counter Start and Stop
 * @{
 */

/*!
 * @brief Starts the Timer counter.
 *
 * @param base Ctimer peripheral base address
 */
static inline void CTIMER_StartTimer(CTIMER_Type *base)
{
    base->TCR |= CTIMER_TCR_CEN_MASK;
}

/*!
 * @brief Stops the Timer counter.
 *
 * @param base Ctimer peripheral base address
 */
static inline void CTIMER_StopTimer(CTIMER_Type *base)
{
    base->TCR &= ~CTIMER_TCR_CEN_MASK;
}

/*! @}*/

/*!
 * @brief Reset the counter.
 *
 * The timer counter and prescale counter are reset on the next positive edge of the APB clock.
 *
 * @param base Ctimer peripheral base address
 */
static inline void CTIMER_Reset(CTIMER_Type *base)
{
    base->TCR |= CTIMER_TCR_CRST_MASK;
    base->TCR &= ~CTIMER_TCR_CRST_MASK;
}

/*!
 * @brief Setup the timer prescale value.
 *
 * Specifies the maximum value for the Prescale Counter.
 *
 * @param base Ctimer peripheral base address
 * @param prescale Prescale value
 */
static inline void CTIMER_SetPrescale(CTIMER_Type *base, uint32_t prescale)
{
    base->PR = CTIMER_PR_PRVAL(prescale);
}

/*!
 * @brief Get capture channel value.
 *
 * Get the counter/timer value on the corresponding capture channel.
 *
 * @param base Ctimer peripheral base address
 * @param capture Select capture channel
 *
 * @return The timer count capture value.
 */
static inline uint32_t CTIMER_GetCaptureValue(CTIMER_Type *base, ctimer_capture_channel_t capture)
{
    return base->CR[capture];
}

/*!
 * @brief Enable reset match channel.
 *
 * Set the specified match channel reset operation.
 *
 * @param base Ctimer peripheral base address
 * @param match match channel used
 * @param enable Enable match channel reset operation.
 */
static inline void CTIMER_EnableResetMatchChannel(CTIMER_Type *base, ctimer_match_t match, bool enable)
{
    if (enable)
    {
        base->MCR |= (1UL << (CTIMER_MCR_MR0R_SHIFT + ((uint32_t)match * 3U)));
    }
    else
    {
        base->MCR &= ~(1UL << (CTIMER_MCR_MR0R_SHIFT + ((uint32_t)match * 3U)));
    }
}

/*!
 * @brief Enable stop match channel.
 *
 * Set the specified match channel stop operation.
 *
 * @param base Ctimer peripheral base address.
 * @param match match channel used.
 * @param enable Enable match channel stop operation.
 */
static inline void CTIMER_EnableStopMatchChannel(CTIMER_Type *base, ctimer_match_t match, bool enable)
{
    if (enable)
    {
        base->MCR |= (1UL << (CTIMER_MCR_MR0S_SHIFT + ((uint32_t)match * 3U)));
    }
    else
    {
        base->MCR &= ~(1UL << (CTIMER_MCR_MR0S_SHIFT + ((uint32_t)match * 3U)));
    }
}

#if (defined(FSL_FEATURE_CTIMER_HAS_MSR) && (FSL_FEATURE_CTIMER_HAS_MSR))
/*!
 * @brief Enable reload channel falling edge.
 *
 * Enable the specified match channel reload match shadow value.
 *
 * @param base Ctimer peripheral base address.
 * @param match match channel used.
 * @param enable Enable .
 */
static inline void CTIMER_EnableMatchChannelReload(CTIMER_Type *base, ctimer_match_t match, bool enable)
{
    if (enable)
    {
        base->MCR |= (1UL << (CTIMER_MCR_MR0RL_SHIFT + (uint32_t)match));
    }
    else
    {
        base->MCR &= ~(1UL << (CTIMER_MCR_MR0RL_SHIFT + (uint32_t)match));
    }
}
#endif /* FSL_FEATURE_CTIMER_HAS_MSR */

/*!
 * @brief Enable capture channel rising edge.
 *
 * Sets the specified capture channel for rising edge capture.
 *
 * @param base Ctimer peripheral base address.
 * @param capture capture channel used.
 * @param enable Enable rising edge capture.
 */
static inline void CTIMER_EnableRisingEdgeCapture(CTIMER_Type *base, ctimer_capture_channel_t capture, bool enable)
{
    if (enable)
    {
        base->CCR |= (1UL << (CTIMER_CCR_CAP0RE_SHIFT + ((uint32_t)capture * 3U)));
    }
    else
    {
        base->CCR &= ~(1UL << (CTIMER_CCR_CAP0RE_SHIFT + ((uint32_t)capture * 3U)));
    }
}

/*!
 * @brief Enable capture channel falling edge.
 *
 * Sets the specified capture channel for falling edge capture.
 *
 * @param base Ctimer peripheral base address.
 * @param capture capture channel used.
 * @param enable Enable falling edge capture.
 */
static inline void CTIMER_EnableFallingEdgeCapture(CTIMER_Type *base, ctimer_capture_channel_t capture, bool enable)
{
    if (enable)
    {
        base->CCR |= (1UL << (CTIMER_CCR_CAP0FE_SHIFT + ((uint32_t)capture * 3U)));
    }
    else
    {
        base->CCR &= ~(1UL << (CTIMER_CCR_CAP0FE_SHIFT + ((uint32_t)capture * 3U)));
    }
}

#if (defined(FSL_FEATURE_CTIMER_HAS_MSR) && (FSL_FEATURE_CTIMER_HAS_MSR))
/*!
 * @brief Set the specified match shadow channel.
 *
 * @param base Ctimer peripheral base address.
 * @param match match channel used.
 * @param matchvalue Reload the value of the corresponding match register.
 */
static inline void CTIMER_SetShadowValue(CTIMER_Type *base, ctimer_match_t match, uint32_t matchvalue)
{
    base->MSR[match] = matchvalue;
}
#endif /* FSL_FEATURE_CTIMER_HAS_MSR */

#if defined(__cplusplus)
}
#endif

/*! @}*/

#endif /* FSL_CTIMER_H_ */
